Catalogs/НастройкиЗагрузкиМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиЗагрузкиМероприятий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСтолбец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтолбец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКомментарий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТипМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьМероприятияИзРеестра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьРезультатыИзРеестра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтолбца</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ОбъектыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОбъектыУчета</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиПоДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиЗагрузкиМероприятий/Ext/ManagerModule.bsl
Функция НастройкиПарсинга(Настройка) Экспорт

	Значения = ЗначенияНастройки(Настройка);
	
	Данные = Новый Структура;
	
	НомераСтолбцов = Новый Структура;
	НомераСтолбцов.Вставить("Объект", Значения.Объект);
	НомераСтолбцов.Вставить("ДатаВыполнения", Значения.ДатаВыполнения);
	НомераСтолбцов.Вставить("ТипМероприятия", Значения.ТипМероприятия);
	НомераСтолбцов.Вставить("Результат", Значения.Результат);
	НомераСтолбцов.Вставить("Комментарий", Значения.Комментарий);

	Данные.Вставить("Столбцы", НомераСтолбцов);
	
	ЗначенияСвойств = ЗначенияНастройкиДопРеквизитов(Настройка);
	Данные.Вставить("СтолбцыСвойств", ЗначенияСвойств);
	
	МодульОбъекта = МодульПоОбъектуУчета(Значения.ОбъектУчета);
	Данные.Вставить("Модуль", МодульОбъекта);
	
	ДанныеПоУмолчанию = Новый Структура;
	ДанныеПоУмолчанию.Вставить("ТипМероприятия", Значения.ТипМероприятияПоУмолчанию);
	ДанныеПоУмолчанию.Вставить("Результат", Значения.РезультатПоУмолчанию);
	Данные.Вставить("ДанныеПоУмолчанию", ДанныеПоУмолчанию);
	
	ДанныеИзРеестра = Новый Структура;
	ДанныеИзРеестра.Вставить("ТипМероприятияИзРеестра", Значения.СоздатьМероприятияИзРеестра); 
	ДанныеИзРеестра.Вставить("РезультатМероприятийИзРеестра", Значения.СоздатьРезультатыИзРеестра);
	Данные.Вставить("ДанныеИзРеестра", ДанныеИзРеестра);
	
	Возврат Данные;

КонецФункции // ()

Функция ДоступныеОбъектыУчета() Экспорт

	Данные = Новый Массив;
	Данные.Добавить(Перечисления.ОбъектыУчета.ДолговыеОбязательства);
	Данные.Добавить(Перечисления.ОбъектыУчета.Контрагенты);
	
	Возврат Данные;
	
КонецФункции // ()

Функция ЗначенияНастройки(Настройка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗагрузкиМероприятий.ОбъектСтолбец КАК Объект,
		|	НастройкиЗагрузкиМероприятий.ОбъектДата КАК ДатаВыполнения,
		|	НастройкиЗагрузкиМероприятий.ОбъектКомментарий КАК Комментарий,
		|	НастройкиЗагрузкиМероприятий.ОбъектТипМероприятия КАК ТипМероприятия,
		|	НастройкиЗагрузкиМероприятий.РезультатСтолбец КАК Результат,
		|	НастройкиЗагрузкиМероприятий.ТипМероприятия КАК ТипМероприятияПоУмолчанию,
		|	НастройкиЗагрузкиМероприятий.РезультатПоУмолчанию КАК РезультатПоУмолчанию,
		|	НастройкиЗагрузкиМероприятий.ОбъектУчета КАК ОбъектУчета,
		|	НастройкиЗагрузкиМероприятий.СоздатьМероприятияИзРеестра КАК СоздатьМероприятияИзРеестра,
		|	НастройкиЗагрузкиМероприятий.СоздатьРезультатыИзРеестра КАК СоздатьРезультатыИзРеестра
		|ИЗ
		|	Справочник.НастройкиЗагрузкиМероприятий КАК НастройкиЗагрузкиМероприятий
		|ГДЕ
		|	НастройкиЗагрузкиМероприятий.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи[0];

КонецФункции // ()

Функция ЗначенияНастройкиДопРеквизитов(Настройка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗагрузкиМероприятийДополнительныеРеквизиты.НомерСтолбца КАК НомерСтолбца,
		|	НастройкиЗагрузкиМероприятийДополнительныеРеквизиты.Свойство КАК Свойство,
		|	НастройкиЗагрузкиМероприятийДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
		|	НастройкиЗагрузкиМероприятийДополнительныеРеквизиты.Свойство.Код КАК Код
		|ИЗ
		|	Справочник.НастройкиЗагрузкиМероприятий.ДополнительныеРеквизиты КАК НастройкиЗагрузкиМероприятийДополнительныеРеквизиты
		|ГДЕ
		|	НастройкиЗагрузкиМероприятийДополнительныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Новый ТаблицаЗначений;
	
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции // ()

Функция МодульПоОбъектуУчета(ОбъектУчета)

	МодульМенеджера = Перечисления.ОбъектыУчета.ПолучитьМодульСправочника(
		ОбъектУчета
	);
	
	Если МодульМенеджера = Неопределено Тогда
	
		ВызватьИсключение "Не удалось найти связи по выбранному объекту учета";
	
	КонецЕсли;
	
	Возврат МодульМенеджера;

КонецФункции // ()
